zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_i3c.c
  return status;
}
/**
  * @}
  */

/**
  * @}
  */

/* Private functions -------------------------------------------------------------------------------------------------*/
/** @defgroup I3C_Private_Functions I3C Private Functions
  * @{
  */

/**
  * @brief  Interrupt Sub-Routine which handles target received events.
  * @param  hi3c       : [IN]  Pointer to an I3C_HandleTypeDef structure that contains the configuration information
  *                            for the specified I3C.
  * @param  itFlags    : [IN]  Interrupt flags to handle.
  * @param  itSources  : [IN]  Interrupt sources enabled.
  * @retval HAL Status :       Value from HAL_StatusTypeDef enumeration.
  */
static HAL_StatusTypeDef I3C_Tgt_Event_ISR(struct __I3C_HandleTypeDef *hi3c, uint32_t itFlags, uint32_t itSources)
{
  uint32_t tmpevent = 0U;
#if defined(I3C_MISR_CFNFMIS)
  uint32_t it_masks = READ_REG(hi3c->Instance->MISR);
  UNUSED(itFlags);
  UNUSED(itSources);
#endif /* I3C_MISR_CFNFMIS */
  /* I3C Rx FIFO not empty interrupt Check */
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_MASKS_RXFNEMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, HAL_I3C_FLAG_RXFNEF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, HAL_I3C_IT_RXFNEIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
  {
    /* Call receive treatment function */
    hi3c->ptrRxFunc(hi3c);
  }

  /* I3C target complete controller-role hand-off procedure (direct GETACCR CCC) event management --------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_MASKS_CRUPDMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_CRUPDF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_CRUPDIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
  {
    /* Clear controller-role update flag */
    LL_I3C_ClearFlag_CRUPD(hi3c->Instance);

    /* Set Identifier EVENT_ID_GETACCCR */
    tmpevent |= EVENT_ID_GETACCCR;
  }

  /* I3C target receive any direct GETxxx CCC event management -------------------------------------------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_MASKS_GETMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_GETF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_GETIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
  {
    /* Clear GETxxx CCC flag */
    LL_I3C_ClearFlag_GET(hi3c->Instance);

    /* Set Identifier EVENT_ID_GETx */
    tmpevent |= EVENT_ID_GETx;
  }

  /* I3C target receive get status command (direct GETSTATUS CCC) event management -----------------------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_MASKS_STAMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_STAF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_STAIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
  {
    /* Clear GETSTATUS CCC flag */
    LL_I3C_ClearFlag_STA(hi3c->Instance);

    /* Set Identifier EVENT_ID_GETSTATUS */
    tmpevent |= EVENT_ID_GETSTATUS;
  }

  /* I3C target receive a dynamic address update (ENTDAA/RSTDAA/SETNEWDA CCC) event management -----------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_MASKS_DAUPDMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_DAUPDF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_DAUPDIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
  {
    /* Clear dynamic address update flag */
    LL_I3C_ClearFlag_DAUPD(hi3c->Instance);

    /* Set Identifier EVENT_ID_DAU */
    tmpevent |= EVENT_ID_DAU;
  }

  /* I3C target receive maximum write length update (direct SETMWL CCC) event management -----------------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_MASKS_MWLUPDMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_MWLUPDF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_MWLUPDIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
  {
    /* Clear SETMWL CCC flag */
    LL_I3C_ClearFlag_MWLUPD(hi3c->Instance);

    /* Set Identifier EVENT_ID_SETMWL */
    tmpevent |= EVENT_ID_SETMWL;
  }

  /* I3C target receive maximum read length update(direct SETMRL CCC) event management -------------------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_MASKS_MRLUPDMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_MRLUPDF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_MRLUPDIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
  {
    /* Clear SETMRL CCC flag */
    LL_I3C_ClearFlag_MRLUPD(hi3c->Instance);

    /* Set Identifier EVENT_ID_SETMRL */
    tmpevent |= EVENT_ID_SETMRL;
  }

  /* I3C target detect reset pattern (broadcast or direct RSTACT CCC) event management -------------------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_MASKS_RSTMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_RSTF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_RSTIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
  {
    /* Clear reset pattern flag */
    LL_I3C_ClearFlag_RST(hi3c->Instance);

    /* Set Identifier EVENT_ID_RSTACT */
    tmpevent |= EVENT_ID_RSTACT;
  }

  /* I3C target receive activity state update (direct or broadcast ENTASx) CCC event management ----------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_MASKS_ASUPDMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_ASUPDF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_ASUPDIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
  {
    /* Clear ENTASx CCC flag */
    LL_I3C_ClearFlag_ASUPD(hi3c->Instance);

    /* Set Identifier EVENT_ID_ENTASx */
    tmpevent |= EVENT_ID_ENTASx;
  }

  /* I3C target receive a direct or broadcast ENEC/DISEC CCC event management ----------------------------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_MASKS_INTUPDMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_INTUPDF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_INTUPDIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
  {
    /* Clear ENEC/DISEC CCC flag */
    LL_I3C_ClearFlag_INTUPD(hi3c->Instance);

