zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_i3c.c
    /* Set Identifier EVENT_ID_ENEC_DISEC */
    tmpevent |= EVENT_ID_ENEC_DISEC;
  }

  /* I3C target receive a broadcast DEFTGTS CCC event management -----------------------------------------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_MASKS_DEFMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_DEFF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_DEFIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
  {
    /* Clear DEFTGTS CCC flag */
    LL_I3C_ClearFlag_DEF(hi3c->Instance);

    /* Set Identifier EVENT_ID_DEFTGTS */
    tmpevent |= EVENT_ID_DEFTGTS;
  }

  /* I3C target receive a group addressing (broadcast DEFGRPA CCC) event management ----------------------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_GRPMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_GRPF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_GRPIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
  {
    /* Clear DEFGRPA CCC flag */
    LL_I3C_ClearFlag_GRP(hi3c->Instance);

    /* Set Identifier EVENT_ID_DEFGRPA */
    tmpevent |= EVENT_ID_DEFGRPA;
  }

  /* I3C target wakeup event management ----------------------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_MASKS_WKPMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_WKPF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_WKPIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
  {
    /* Clear WKP flag */
    LL_I3C_ClearFlag_WKP(hi3c->Instance);

    /* Set Identifier EVENT_ID_WKP */
    tmpevent |= EVENT_ID_WKP;
  }

  if (tmpevent != 0U)
  {
#if (USE_HAL_I3C_REGISTER_CALLBACKS == 1U)
    /* Call registered callback */
    hi3c->NotifyCallback(hi3c, tmpevent);
#else
    /* Asynchronous receive CCC event Callback */
    HAL_I3C_NotifyCallback(hi3c, tmpevent);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS == 1U */
  }

  /* Update handle state parameter */
  I3C_StateUpdate(hi3c);

  return HAL_OK;
}

/**
  * @brief  Interrupt Sub-Routine which handles Controller received events.
  * @param  hi3c       : [IN]  Pointer to an I3C_HandleTypeDef structure that contains the configuration information
  *                            for the specified I3C.
  * @param  itFlags    : [IN]  Interrupt flags to handle.
  * @param  itSources  : [IN]  Interrupt sources enabled.
  * @retval HAL Status :       Value from HAL_StatusTypeDef enumeration.
  */
static HAL_StatusTypeDef I3C_Ctrl_Event_ISR(struct __I3C_HandleTypeDef *hi3c, uint32_t itFlags, uint32_t itSources)
{
#if defined(I3C_MISR_CFNFMIS)
  uint32_t it_masks = READ_REG(hi3c->Instance->MISR);
  UNUSED(itFlags);
  UNUSED(itSources);
#endif /* I3C_MISR_CFNFMIS */
  /* I3C controller receive IBI event management ---------------------------------------------------------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_IBIMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_IBIF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_IBIIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
  {
    /* Clear IBI request flag */
    LL_I3C_ClearFlag_IBI(hi3c->Instance);

#if (USE_HAL_I3C_REGISTER_CALLBACKS == 1U)
    /* Call registered callback */
    hi3c->NotifyCallback(hi3c, EVENT_ID_IBI);
#else
    /* Asynchronous IBI event Callback */
    HAL_I3C_NotifyCallback(hi3c, EVENT_ID_IBI);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS == 1U */
  }

  /* I3C controller controller-role request event management ---------------------------------------------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_CRMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_CRF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_CRIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
  {
    /* Clear controller-role request flag */
    LL_I3C_ClearFlag_CR(hi3c->Instance);

#if (USE_HAL_I3C_REGISTER_CALLBACKS == 1U)
    /* Call registered callback */
    hi3c->NotifyCallback(hi3c, EVENT_ID_CR);
#else
    /* Asynchronous controller-role event Callback */
    HAL_I3C_NotifyCallback(hi3c, EVENT_ID_CR);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS == 1U */
  }

  /* I3C controller hot-join event management ------------------------------------------------------------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_HJMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_HJF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_HJIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
  {
    /* Clear hot-join flag */
    LL_I3C_ClearFlag_HJ(hi3c->Instance);

#if (USE_HAL_I3C_REGISTER_CALLBACKS == 1U)
    /* Call registered callback */
    hi3c->NotifyCallback(hi3c, EVENT_ID_HJ);
#else
    /* Asynchronous hot-join event Callback */
    HAL_I3C_NotifyCallback(hi3c, EVENT_ID_HJ);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS == 1U */
  }

  /* Update handle state parameter */
  I3C_StateUpdate(hi3c);

  return HAL_OK;
}

/**
  * @brief  Interrupt Sub-Routine which handles target hot join event.
  * @param  hi3c       : [IN]  Pointer to an I3C_HandleTypeDef structure that contains the configuration information
  *                            for the specified I3C.
  * @param  itFlags    : [IN]  Interrupt flags to handle.
  * @param  itSources  : [IN]  Interrupt sources enabled.
  * @retval HAL Status :       Value from HAL_StatusTypeDef enumeration.
  */
static HAL_StatusTypeDef I3C_Tgt_HotJoin_ISR(struct __I3C_HandleTypeDef *hi3c, uint32_t itFlags, uint32_t itSources)
{
#if defined(I3C_MISR_CFNFMIS)
  uint32_t it_masks = READ_REG(hi3c->Instance->MISR);
  UNUSED(itFlags);
  UNUSED(itSources);
#endif /* I3C_MISR_CFNFMIS */
  /* I3C target receive a dynamic address update event management */
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_MASKS_DAUPDMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_DAUPDF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_DAUPDIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
  {
    /* Clear dynamic address update flag */
    LL_I3C_ClearFlag_DAUPD(hi3c->Instance);

    /* Disable dynamic address update and error interrupts */
    I3C_Disable_IRQ(hi3c, I3C_XFER_TARGET_HOTJOIN);

    /* Check the validity of the own dynamic address */
    if (LL_I3C_IsEnabledOwnDynAddress(hi3c->Instance) == 1U)
    {
      /* Update handle state parameter */
      I3C_StateUpdate(hi3c);

      hi3c->ErrorCode = HAL_I3C_ERROR_NONE;

#if (USE_HAL_I3C_REGISTER_CALLBACKS == 1U)
      /* Call registered callback */
      hi3c->TgtHotJoinCallback(hi3c, (uint8_t)LL_I3C_GetOwnDynamicAddress(hi3c->Instance));
#else
      /* Asynchronous receive ENTDAA/RSTDAA/SETNEWDA CCC event Callback */
      HAL_I3C_TgtHotJoinCallback(hi3c, (uint8_t)LL_I3C_GetOwnDynamicAddress(hi3c->Instance));
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS == 1U */
    }
    else
    {
      hi3c->ErrorCode = HAL_I3C_ERROR_DYNAMIC_ADDR;

      /* Call error treatment function */
      I3C_ErrorTreatment(hi3c);
    }
  }
  return HAL_OK;
}

/**
  * @brief  Interrupt Sub-Routine which handles target control role event.
  * @param  hi3c       : [IN]  Pointer to an I3C_HandleTypeDef structure that contains the configuration information
  *                            for the specified I3C.
  * @param  itFlags    : [IN]  Interrupt flags to handle.
  * @param  itSources  : [IN]  Interrupt sources enabled.
  * @retval HAL Status :       Value from HAL_StatusTypeDef enumeration.
  */
static HAL_StatusTypeDef I3C_Tgt_CtrlRole_ISR(struct __I3C_HandleTypeDef *hi3c, uint32_t itFlags, uint32_t itSources)
{
#if defined(I3C_MISR_CFNFMIS)
  uint32_t it_masks = READ_REG(hi3c->Instance->MISR);
  UNUSED(itFlags);
  UNUSED(itSources);
#endif /* I3C_MISR_CFNFMIS */
  /* I3C target complete controller-role hand-off procedure (direct GETACCR CCC) event management -------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_MASKS_CRUPDMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_CRUPDF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_CRUPDIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
  {
    /* Clear controller-role update flag */
    LL_I3C_ClearFlag_CRUPD(hi3c->Instance);

    /* Disable controller-role update and error interrupts */
    I3C_Disable_IRQ(hi3c, I3C_XFER_TARGET_CTRLROLE);

