zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_i3c.c
  /* I3C controller controller-role request event management ---------------------------------------------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_CRMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_CRF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_CRIE) != RESET))
#endif
  {
    /* Clear controller-role request flag */
    LL_I3C_ClearFlag_CR(hi3c->Instance);

#if (USE_HAL_I3C_REGISTER_CALLBACKS == 1U)
    /* Call registered callback */
    hi3c->NotifyCallback(hi3c, EVENT_ID_CR);
#else
    /* Asynchronous controller-role event Callback */
    HAL_I3C_NotifyCallback(hi3c, EVENT_ID_CR);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS == 1U */
  }

  /* I3C controller hot-join event management ------------------------------------------------------------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_HJMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_HJF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_HJIE) != RESET))
#endif
  {
    /* Clear hot-join flag */
    LL_I3C_ClearFlag_HJ(hi3c->Instance);

#if (USE_HAL_I3C_REGISTER_CALLBACKS == 1U)
    /* Call registered callback */
    hi3c->NotifyCallback(hi3c, EVENT_ID_HJ);
#else
    /* Asynchronous hot-join event Callback */
    HAL_I3C_NotifyCallback(hi3c, EVENT_ID_HJ);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS == 1U */
  }

  /* ISR controller transmission */
  return (I3C_Ctrl_Tx_ISR(hi3c, itFlags, itSources));
}

/**
  * @brief  Interrupt Sub-Routine which handles controller reception and Controller received events in interrupt mode.
  * @param  hi3c       : [IN]  Pointer to an I3C_HandleTypeDef structure that contains the configuration information
  *                            for the specified I3C.
  * @param  it_masks    : [IN]  Flag Interrupt Masks flags to handle.
  * @retval HAL Status :       Value from HAL_StatusTypeDef enumeration.
  */
static HAL_StatusTypeDef I3C_Ctrl_Rx_Listen_Event_ISR(struct __I3C_HandleTypeDef *hi3c,
                                                      uint32_t itFlags,
                                                      uint32_t itSources)
{
#if defined(I3C_MISR_CFNFMIS)
  uint32_t it_masks = READ_REG(hi3c->Instance->MISR);
  UNUSED(itFlags);
  UNUSED(itSources);
#endif /* I3C_MISR_CFNFMIS */
  /* I3C controller receive IBI event management ---------------------------------------------------------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_IBIMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_IBIF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_IBIIE) != RESET))
#endif
  {
    /* Clear IBI request flag */
    LL_I3C_ClearFlag_IBI(hi3c->Instance);

#if (USE_HAL_I3C_REGISTER_CALLBACKS == 1U)
    /* Call registered callback */
    hi3c->NotifyCallback(hi3c, EVENT_ID_IBI);
#else
    /* Asynchronous IBI event Callback */
    HAL_I3C_NotifyCallback(hi3c, EVENT_ID_IBI);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS == 1U */
  }

  /* I3C controller controller-role request event management ---------------------------------------------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_CRMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_CRF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_CRIE) != RESET))
#endif
  {
    /* Clear controller-role request flag */
    LL_I3C_ClearFlag_CR(hi3c->Instance);

#if (USE_HAL_I3C_REGISTER_CALLBACKS == 1U)
    /* Call registered callback */
    hi3c->NotifyCallback(hi3c, EVENT_ID_CR);
#else
    /* Asynchronous controller-role event Callback */
    HAL_I3C_NotifyCallback(hi3c, EVENT_ID_CR);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS == 1U */
  }

  /* I3C controller hot-join event management ------------------------------------------------------------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_HJMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_HJF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_HJIE) != RESET))
#endif
  {
    /* Clear hot-join flag */
    LL_I3C_ClearFlag_HJ(hi3c->Instance);

#if (USE_HAL_I3C_REGISTER_CALLBACKS == 1U)
    /* Call registered callback */
    hi3c->NotifyCallback(hi3c, EVENT_ID_HJ);
#else
    /* Asynchronous hot-join event Callback */
    HAL_I3C_NotifyCallback(hi3c, EVENT_ID_HJ);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS == 1U */
  }

  /* ISR controller reception */
  return (I3C_Ctrl_Rx_ISR(hi3c, itFlags, itSources));
}

/**
  * @brief  Interrupt Sub-Routine which handles controller multiple transmission/reception  and
  *         Controller received eventsin interrupt mode.
  * @param  hi3c       : [IN]  Pointer to an I3C_HandleTypeDef structure that contains the configuration information
  *                            for the specified I3C.
  * @param  itFlags    : [IN]  Interrupt flags to handle.
  * @param  itSources  : [IN]  Interrupt sources enabled.
  * @retval HAL Status :       Value from HAL_StatusTypeDef enumeration.
  */
static HAL_StatusTypeDef I3C_Ctrl_Multiple_Xfer_Listen_Event_ISR(struct __I3C_HandleTypeDef *hi3c,
                                                                 uint32_t itFlags,
                                                                 uint32_t itSources)
{
#if defined(I3C_MISR_CFNFMIS)
  uint32_t it_masks = READ_REG(hi3c->Instance->MISR);
  UNUSED(itFlags);
  UNUSED(itSources);
#endif /* I3C_MISR_CFNFMIS */
  /* I3C controller receive IBI event management ---------------------------------------------------------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_IBIMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_IBIF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_IBIIE) != RESET))
#endif
  {
    /* Clear IBI request flag */
    LL_I3C_ClearFlag_IBI(hi3c->Instance);

#if (USE_HAL_I3C_REGISTER_CALLBACKS == 1U)
    /* Call registered callback */
    hi3c->NotifyCallback(hi3c, EVENT_ID_IBI);
#else
    /* Asynchronous IBI event Callback */
    HAL_I3C_NotifyCallback(hi3c, EVENT_ID_IBI);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS == 1U */
  }

