zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_i3c.c
  /* I3C controller controller-role request event management ---------------------------------------------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_CRMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_CRF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_CRIE) != RESET))
#endif
  {
    /* Clear controller-role request flag */
    LL_I3C_ClearFlag_CR(hi3c->Instance);

#if (USE_HAL_I3C_REGISTER_CALLBACKS == 1U)
    /* Call registered callback */
    hi3c->NotifyCallback(hi3c, EVENT_ID_CR);
#else
    /* Asynchronous controller-role event Callback */
    HAL_I3C_NotifyCallback(hi3c, EVENT_ID_CR);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS == 1U */
  }

  /* I3C controller hot-join event management ------------------------------------------------------------------------*/
#if defined(I3C_MISR_CFNFMIS)
  if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_HJMIS) != RESET)
#else
  if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_HJF) != RESET) &&
      (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_HJIE) != RESET))
#endif
  {
    /* Clear hot-join flag */
    LL_I3C_ClearFlag_HJ(hi3c->Instance);

#if (USE_HAL_I3C_REGISTER_CALLBACKS == 1U)
    /* Call registered callback */
    hi3c->NotifyCallback(hi3c, EVENT_ID_HJ);
#else
    /* Asynchronous hot-join event Callback */
    HAL_I3C_NotifyCallback(hi3c, EVENT_ID_HJ);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS == 1U */
  }

  /* ISR controller transmission/reception */
  return (I3C_Ctrl_Multiple_Xfer_ISR(hi3c, itFlags, itSources));
}
/**
  * @brief  Interrupt Sub-Routine which handles controller CCC Dynamic Address Assignment command in interrupt mode.
  * @param  hi3c       : [IN]  Pointer to an I3C_HandleTypeDef structure that contains the configuration information
  *                            for the specified I3C.
  * @param  itFlags    : [IN]  Interrupt flags to handle.
  * @param  itSources  : [IN]  Interrupt sources enabled.
  * @retval HAL Status :       Value from HAL_StatusTypeDef enumeration.
  */
static HAL_StatusTypeDef I3C_Ctrl_DAA_ISR(struct __I3C_HandleTypeDef *hi3c, uint32_t itFlags, uint32_t itSources)
{
#if defined(I3C_MISR_CFNFMIS)
  uint32_t it_masks = READ_REG(hi3c->Instance->MISR);
  UNUSED(itFlags);
  UNUSED(itSources);
#endif /* I3C_MISR_CFNFMIS */
  uint64_t target_payload = 0U;

  /* Check that a Dynamic Address Assignment process is ongoing */
  if (hi3c->State == HAL_I3C_STATE_BUSY_DAA)
  {
    /* I3C Control FIFO not full interrupt Check */
#if defined(I3C_MISR_CFNFMIS)
    if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_CFNFMIS) != RESET)
#else
    if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_CFNFF) != RESET) &&
        (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_CFNFIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
    {
      /* Write ENTDAA CCC information in the control register */
      LL_I3C_ControllerHandleCCC(hi3c->Instance, I3C_BROADCAST_ENTDAA, 0U, LL_I3C_GENERATE_STOP);
    }

    /* I3C Tx FIFO not full interrupt Check */
#if defined(I3C_MISR_CFNFMIS)
    if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_MASKS_TXFNFMIS) != RESET)
#else
    if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_TXFNFF) != RESET) &&
        (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_TXFNFIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
    {
      /* Check on the Rx FIFO threshold to know the Dynamic Address Assignment treatment process : byte or word */
      if (LL_I3C_GetRxFIFOThreshold(hi3c->Instance) == LL_I3C_RXFIFO_THRESHOLD_1_4)
      {
        /* For loop to get target payload */
        for (uint32_t index = 0U; index < 8U; index++)
        {
          /* Retrieve payload byte by byte */
          target_payload |= (uint64_t)((uint64_t)LL_I3C_ReceiveData8(hi3c->Instance) << (index * 8U));
        }
      }
      else
      {
        /* Retrieve first 32 bits payload */
        target_payload = (uint64_t)LL_I3C_ReceiveData32(hi3c->Instance);

        /* Retrieve second 32 bits payload */
        target_payload |= (uint64_t)((uint64_t)LL_I3C_ReceiveData32(hi3c->Instance) << 32U);
      }

      /* Call the corresponding callback */
#if (USE_HAL_I3C_REGISTER_CALLBACKS == 1U)
      hi3c->TgtReqDynamicAddrCallback(hi3c, target_payload);
#else
      HAL_I3C_TgtReqDynamicAddrCallback(hi3c, target_payload);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
    }

    /* I3C frame complete event Check */
#if defined(I3C_MISR_CFNFMIS)
    if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_MASKS_FCMIS) != RESET)
#else
    if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_FCF) != RESET) &&
        (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_FCIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
    {
      /* Clear frame complete flag */
      LL_I3C_ClearFlag_FC(hi3c->Instance);

      /* Disable Dynamic Address Assignment process interrupts */
      I3C_Disable_IRQ(hi3c, I3C_XFER_CONTROLLER_DAA_IT);

      /* Update handle state parameter */
      I3C_StateUpdate(hi3c);

      hi3c->ErrorCode = HAL_I3C_ERROR_NONE;

      /* Call the Dynamic Address Assignment complete callback */
#if (USE_HAL_I3C_REGISTER_CALLBACKS == 1U)
      hi3c->CtrlDAACpltCallback(hi3c);
#else
      HAL_I3C_CtrlDAACpltCallback(hi3c);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS == 1U */
    }
  }
  return HAL_OK;
}

#if defined(HAL_DMA_MODULE_ENABLED)
/**
  * @brief  Interrupt Sub-Routine which handles controller transmit data in DMA mode.
  * @param  hi3c       : [IN]  Pointer to an I3C_HandleTypeDef structure that contains the configuration information
  *                            for the specified I3C.
  * @param  itFlags    : [IN]  Interrupt flags to handle.
  * @param  itSources  : [IN]  Interrupt sources enabled.
  * @retval HAL Status :       Value from HAL_StatusTypeDef enumeration.
  */
static HAL_StatusTypeDef I3C_Ctrl_Tx_DMA_ISR(struct __I3C_HandleTypeDef *hi3c, uint32_t itFlags, uint32_t itSources)
{
#if defined(I3C_MISR_CFNFMIS)
  uint32_t it_masks = READ_REG(hi3c->Instance->MISR);
  UNUSED(itFlags);
  UNUSED(itSources);
#endif /* I3C_MISR_CFNFMIS */
  /* Check that a Tx process is ongoing */
  if (hi3c->State == HAL_I3C_STATE_BUSY_TX)
  {
    /* I3C target frame complete event Check */
#if defined(I3C_MISR_CFNFMIS)
    if (I3C_CHECK_FLAG(it_masks, HAL_I3C_IT_MASKS_FCMIS) != RESET)
#else
    if ((I3C_CHECK_FLAG(itFlags, I3C_EVR_FCF) != RESET) &&
        (I3C_CHECK_IT_SOURCE(itSources, I3C_IER_FCIE) != RESET))
#endif /* I3C_MISR_CFNFMIS */
    {
      /* Clear frame complete flag */
      LL_I3C_ClearFlag_FC(hi3c->Instance);

